tap "homebrew/bundle"
brew "bat"
brew "dotnet"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "htop"
brew "jq"
brew "mas"
brew "node"
brew "ollama"
brew "pnpm"
brew "poppler"
brew "prettier"
brew "pyenv"
brew "ripgrep"
brew "tldr"
cask "adobe-creative-cloud"
cask "blender"
cask "box-drive"
cask "discord"
cask "docker"
cask "git-credential-manager"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "logi-options+"
cask "macdroid"
cask "maxon"
cask "meetingbar"
cask "notion"
cask "optimage"
cask "postman"
cask "slack"
cask "tailscale"
cask "the-unarchiver"
cask "unity-hub"
cask "visual-studio-code"
cask "zoom"
cask "zotero"
mas "Hidden Bar", id: 1452453066
mas "Whisper Transcription", id: 1668083311
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "bradlc.vscode-tailwindcss"
vscode "csharpier.csharpier-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "iamhyc.overleaf-workshop"
vscode "jackiotyu.size-tree"
vscode "janisdd.vscode-edit-csv"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ptd.vscode-unitymeta"
vscode "raczzalan.webgl-glsl-editor"
vscode "reverbc.vscode-pytest"
vscode "slevesque.shader"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-gradle"
