tap "daniyalmaster693/casks"
tap "heroku/brew"
tap "homebrew/bundle"
brew "bat"
brew "cocoapods"
brew "dotnet"
brew "eza"
brew "fileicon"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "node"
brew "heroku"
brew "htop"
brew "python@3.14"
brew "huggingface-cli"
brew "jq"
brew "mas"
brew "ollama"
brew "openjdk"
brew "pnpm"
brew "poppler"
brew "prettier"
brew "pydantic-core"
brew "pyenv"
brew "tcl-tk"
brew "python-tk@3.13"
brew "rbenv"
brew "ripgrep"
brew "starship"
brew "tldr"
brew "tmux"
brew "watchman"
brew "xxh"
brew "yarn"
brew "zoxide"
cask "adobe-creative-cloud"
cask "bambu-studio"
cask "blender"
cask "box-drive"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "elan"
cask "font-lexend"
cask "ghostty"
cask "git-credential-manager"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "logi-options+"
cask "macdroid"
cask "maxon"
cask "menuscores"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "ngrok"
cask "optimage"
cask "postman"
cask "slack"
cask "steam"
cask "tailscale-app"
cask "the-unarchiver"
cask "unity-hub"
cask "visual-studio-code"
cask "zoom"
cask "zotero"
mas "Developer", id: 640199958
mas "Hidden Bar", id: 1452453066
mas "WhatsApp", id: 310633997
mas "Whisper Transcription", id: 1668083311
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "bradlc.vscode-tailwindcss"
vscode "csharpier.csharpier-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "iamhyc.overleaf-workshop"
vscode "jackiotyu.size-tree"
vscode "janisdd.vscode-edit-csv"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ptd.vscode-unitymeta"
vscode "raczzalan.webgl-glsl-editor"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "reverbc.vscode-pytest"
vscode "slevesque.shader"
vscode "snapinc.studio-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "swiftlang.swift-vscode"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "wallabyjs.quokka-vscode"
